AchimPieters/esp32-homekit-Sunshade/main/main.c
// -----------------------------------------------------------------------------
// Identify – blink both GPIO LED and NeoPixel
// -----------------------------------------------------------------------------
static void accessory_identify_task(void *args) {
        for (int i = 0; i < 3; i++) {
                neopixel_set_rgb(20, 20, 20);
                led_write(true);
                vTaskDelay(pdMS_TO_TICKS(150));
                neopixel_off();
                led_write(false);
                vTaskDelay(pdMS_TO_TICKS(150));
        }
        led_write(led_on);
        vTaskDelete(NULL);
}
static void accessory_identify(homekit_value_t _value) {
        ESP_LOGI("INFO", "Accessory identify");
        xTaskCreate(accessory_identify_task, "identify", configMINIMAL_STACK_SIZE, NULL, 2, NULL);
}

// -----------------------------------------------------------------------------
// HomeKit metadata
// -----------------------------------------------------------------------------
#define DEVICE_NAME          "HomeKit Sunshade"
#define DEVICE_MANUFACTURER  "StudioPieters®"
#define DEVICE_SERIAL        "Y3GLW8G950FW"
#define DEVICE_MODEL         "VB14B1CA/H"

homekit_characteristic_t name         = HOMEKIT_CHARACTERISTIC_(NAME, DEVICE_NAME);
homekit_characteristic_t manufacturer = HOMEKIT_CHARACTERISTIC_(MANUFACTURER, DEVICE_MANUFACTURER);
homekit_characteristic_t serial       = HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, DEVICE_SERIAL);
homekit_characteristic_t model        = HOMEKIT_CHARACTERISTIC_(MODEL, DEVICE_MODEL);
homekit_characteristic_t revision     = HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
homekit_characteristic_t ota_trigger  = API_OTA_TRIGGER;

// -----------------------------------------------------------------------------
// Window Covering state + optional Recalibrate switch
// -----------------------------------------------------------------------------
/*
 * HomeKit:
 * CurrentPosition:   0 = closed, 100 = open
 * TargetPosition:    0..100
 * PositionState:     0=DECREASING (closing)  1=INCREASING (opening)  2=STOPPED
 */
static TaskHandle_t move_task_handle = NULL;
static float pos_f = 0.0f; // internal position 0..100
static uint32_t full_travel_ms = FULL_TRAVEL_MS_DEFAULT;

static homekit_characteristic_t current_position =
        HOMEKIT_CHARACTERISTIC_(CURRENT_POSITION, 0);
static homekit_characteristic_t target_position =
        HOMEKIT_CHARACTERISTIC_(TARGET_POSITION, 0);
static homekit_characteristic_t position_state =
        HOMEKIT_CHARACTERISTIC_(POSITION_STATE, 2);
static homekit_characteristic_t obstruction_detected =
        HOMEKIT_CHARACTERISTIC_(OBSTRUCTION_DETECTED, false);
static homekit_characteristic_t hold_position =
        HOMEKIT_CHARACTERISTIC_(HOLD_POSITION, false);

// Optional HomeKit "Recalibrate" (momentary) switch characteristic
static void hk_recal_switch_set(homekit_value_t value);
static homekit_characteristic_t recalibrate_switch =
        HOMEKIT_CHARACTERISTIC_(ON, false, .setter = hk_recal_switch_set);

// Forward decl
static void start_move_to(uint8_t target);

// -----------------------------------------------------------------------------
// NVS helpers (calibration storage)
// -----------------------------------------------------------------------------
static esp_err_t calib_load(uint32_t *out_ms) {
        nvs_handle_t nvh;
        esp_err_t err = nvs_open("sunshade", NVS_READONLY, &nvh);
        if (err != ESP_OK) return err;
        uint32_t v = 0;
        err = nvs_get_u32(nvh, "full_ms", &v);
        nvs_close(nvh);
        if (err == ESP_OK && v >= 3000 && v <= 120000) { *out_ms = v; return ESP_OK; }
        return ESP_ERR_INVALID_STATE;
}
static esp_err_t calib_save(uint32_t ms) {
        nvs_handle_t nvh;
        ESP_RETURN_ON_ERROR(nvs_open("sunshade", NVS_READWRITE, &nvh), "CAL", "NVS open");
        ESP_ERROR_CHECK(nvs_set_u32(nvh, "full_ms", ms));
        ESP_ERROR_CHECK(nvs_commit(nvh));
        nvs_close(nvh);
        return ESP_OK;
}

// -----------------------------------------------------------------------------
// Movement task
// -----------------------------------------------------------------------------
static void move_task(void *param) {
        uint8_t tgt = (uint8_t)(intptr_t)param;
        const float step = (100.0f * (float)MOVE_TICK_MS) / (float)full_travel_ms; // % per tick

        if (tgt > (uint8_t)pos_f) {
                position_state.value = HOMEKIT_UINT8(1); // opening
                homekit_characteristic_notify(&position_state, position_state.value);
                pix_state = PIX_OPENING;
                motor_drive_open(true);
                while (pos_f < tgt && position_state.value.uint8_value == 1) {
                        pos_f += step;
                        if (pos_f > 100.0f) pos_f = 100.0f;
                        uint8_t cp = (uint8_t)(pos_f + 0.5f);
                        if (cp != current_position.value.uint8_value) {
                                current_position.value = HOMEKIT_UINT8(cp);
                                homekit_characteristic_notify(&current_position, current_position.value);
                        }
                        vTaskDelay(pdMS_TO_TICKS(MOVE_TICK_MS));
                }
        } else if (tgt < (uint8_t)pos_f) {
                position_state.value = HOMEKIT_UINT8(0); // closing
                homekit_characteristic_notify(&position_state, position_state.value);
                pix_state = PIX_CLOSING;
                motor_drive_close(true);
                while (pos_f > tgt && position_state.value.uint8_value == 0) {
                        pos_f -= step;
                        if (pos_f < 0.0f) pos_f = 0.0f;
                        uint8_t cp = (uint8_t)(pos_f + 0.5f);
                        if (cp != current_position.value.uint8_value) {
                                current_position.value = HOMEKIT_UINT8(cp);
                                homekit_characteristic_notify(&current_position, current_position.value);
                        }
                        vTaskDelay(pdMS_TO_TICKS(MOVE_TICK_MS));
                }
        }

        motor_all_off();
        position_state.value = HOMEKIT_UINT8(2); // stopped
        homekit_characteristic_notify(&position_state, position_state.value);

