AchimPieters/esp32-homekit-Sunshade/main/main.c
        // Snap exact target value
        pos_f = tgt;
        if (current_position.value.uint8_value != tgt) {
                current_position.value = HOMEKIT_UINT8(tgt);
                homekit_characteristic_notify(&current_position, current_position.value);
        }

        pix_state = (tgt == 0 || tgt == 100) ? PIX_IDLE : PIX_STOPPED;

        move_task_handle = NULL;
        vTaskDelete(NULL);
}

static void start_move_to(uint8_t target) {
        if (move_task_handle) {
                vTaskDelete(move_task_handle);
                move_task_handle = NULL;
        }
        motor_all_off();

        if (target == (uint8_t)pos_f) {
                position_state.value = HOMEKIT_UINT8(2);
                homekit_characteristic_notify(&position_state, position_state.value);
                pix_state = PIX_STOPPED;
                return;
        }
        xTaskCreate(move_task, "move", 3072, (void *)(intptr_t)target, 5, &move_task_handle);
}

// Convenience helpers that also notify target_position
static void start_move_open(void) {
        if (target_position.value.uint8_value != 100) {
                target_position.value = HOMEKIT_UINT8(100);
                homekit_characteristic_notify(&target_position, target_position.value);
        }
        start_move_to(100);
}
static void start_move_close(void) {
        if (target_position.value.uint8_value != 0) {
                target_position.value = HOMEKIT_UINT8(0);
                homekit_characteristic_notify(&target_position, target_position.value);
        }
        start_move_to(0);
}
static void start_move_mid(void) { // used by STOP double-click
        if (target_position.value.uint8_value != MID_POSITION) {
                target_position.value = HOMEKIT_UINT8(MID_POSITION);
                homekit_characteristic_notify(&target_position, target_position.value);
        }
        start_move_to(MID_POSITION);
}

// -----------------------------------------------------------------------------
// HomeKit setters
// -----------------------------------------------------------------------------
static void target_position_set(homekit_value_t value) {
        if (value.format != homekit_format_uint8) return;
        uint8_t t = value.uint8_value;
        ESP_LOGI(MOTOR_TAG, "New target: %u", t);
        target_position.value = value; // store
        start_move_to(t);
        homekit_characteristic_notify(&target_position, target_position.value);
}

static void hold_position_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) return;
        if (value.bool_value) {
                ESP_LOGI(MOTOR_TAG, "Hold position (STOP)");
                motor_all_off();
                position_state.value = HOMEKIT_UINT8(2);
                homekit_characteristic_notify(&position_state, position_state.value);
                pix_state = PIX_STOPPED;
        }
        hold_position.value = HOMEKIT_BOOL(false); // auto-reset to false
        homekit_characteristic_notify(&hold_position, hold_position.value);
}

// Recalibrate switch setter (momentary behavior)
//  - ON -> if IDLE enter calibration; if already calibrating, cancel
//  - Always auto-resets to OFF
static void hk_recal_switch_set(homekit_value_t value);

// -----------------------------------------------------------------------------
// Calibration state machine
// -----------------------------------------------------------------------------
typedef enum {
        CAL_IDLE = 0,
        CAL_ARMED, // activated via STOP long-press or Recalibrate switch
        CAL_RUNNING // measuring (opening while timing)
} calib_state_t;

static calib_state_t calib_state = CAL_IDLE;
static int64_t calib_start_us = 0;

static void calib_enter(void) {
        if (calib_state != CAL_IDLE) return;
        ESP_LOGI("CAL", "Calibration MODE ON: set shade fully CLOSED, press OPEN to start timing, press STOP when fully OPEN.");
        motor_all_off();
        calib_state = CAL_ARMED;
        pix_state = PIX_CALIBRATING;
}

static void calib_cancel(void) {
        if (calib_state == CAL_IDLE) return;
        ESP_LOGI("CAL", "Calibration CANCELLED");
        motor_all_off();
        calib_state = CAL_IDLE;
        pix_state = PIX_IDLE;
}

static void calib_start_run(void) {
        if (calib_state != CAL_ARMED) return;
        // Assumption: start at fully CLOSED
        ESP_LOGI("CAL", "Calibration START: opening and measuring travel time…");
        calib_start_us = esp_timer_get_time();
        calib_state = CAL_RUNNING;
        // Force fully open movement without altering HomeKit target
        if (move_task_handle) { vTaskDelete(move_task_handle); move_task_handle = NULL; }
        position_state.value = HOMEKIT_UINT8(1);
        homekit_characteristic_notify(&position_state, position_state.value);
        motor_drive_open(true);
        pix_state = PIX_CALIBRATING;
}

static void calib_finish_on_stop(void) {
        if (calib_state != CAL_RUNNING) return;
        motor_all_off();
        int64_t elapsed = esp_timer_get_time() - calib_start_us; // us
        if (elapsed < 3 * 1000 * 1000) { // < 3s is likely invalid
                ESP_LOGW("CAL", "Measurement too short (%lld us). Aborted.", (long long)elapsed);
                calib_cancel();
                return;
        }
        uint32_t ms = (uint32_t)(elapsed / 1000);
        ESP_LOGI("CAL", "Calibration DONE: full_travel_ms=%u", ms);
        full_travel_ms = ms;
        calib_save(ms);

        // Set position = 100 (fully open)
        pos_f = 100.0f;
        current_position.value = HOMEKIT_UINT8(100);
        position_state.value = HOMEKIT_UINT8(2);
        homekit_characteristic_notify(&current_position, current_position.value);
        homekit_characteristic_notify(&position_state, position_state.value);

        calib_state = CAL_IDLE;
        pix_state = PIX_IDLE;
}

// Implement recalibrate switch setter now that helpers exist
static void hk_recal_switch_set(homekit_value_t value) {
        bool on = (value.format == homekit_format_bool) ? value.bool_value : false;
        if (on) {
                // Toggle-like behavior: pressing while active cancels
                if (calib_state == CAL_IDLE) calib_enter();
                else calib_cancel();
        }
        // Momentary: auto-reset to OFF
        recalibrate_switch.value = HOMEKIT_BOOL(false);
        homekit_characteristic_notify(&recalibrate_switch, recalibrate_switch.value);
}

