AchimPieters/esp32-homekit-Sunshade/main/main.c
// -----------------------------------------------------------------------------
// Buttons
// -----------------------------------------------------------------------------
static button_handle_t btn_open = NULL;
static button_handle_t btn_stop = NULL;
static button_handle_t btn_close = NULL;

static void btn_open_single_cb(void *arg) {
        if (calib_state == CAL_ARMED) { calib_start_run(); return; }
        if (calib_state == CAL_RUNNING) return; // ignore targets during calibration
        start_move_open();
}
static void btn_close_single_cb(void *arg) {
        if (calib_state != CAL_IDLE) return; // ignore during calibration
        start_move_close();
}
static void btn_stop_single_cb(void *arg) {
        if (calib_state == CAL_RUNNING) { calib_finish_on_stop(); return; }
        // Normal STOP
        homekit_value_t v = HOMEKIT_BOOL(true);
        hold_position_set(v);
}
// Double-click STOP -> move to 50%
static void btn_stop_double_cb(void *arg) {
        if (calib_state != CAL_IDLE) return; // ignore during calibration
        ESP_LOGI("BTN", "STOP double-click -> move to %d%%", MID_POSITION);
        start_move_mid();
}
// Long-press STOP -> toggle calibration
static void btn_stop_long_cb(void *arg) {
        if (calib_state == CAL_IDLE) calib_enter();
        else calib_cancel();
}

static void buttons_init(void) {
        button_config_t cfg_open = {
                .type = BUTTON_TYPE_GPIO,
                .long_press_time = 3000, // ms
                .short_press_time = 50, // debounce/tap
                .gpio_button_config = {
                        .gpio_num = BTN_OPEN_GPIO,
                        .active_level = CONFIG_BUTTON_ACTIVE_LEVEL
                }
        };
        button_config_t cfg_stop = cfg_open;
        cfg_stop.gpio_button_config.gpio_num = BTN_STOP_GPIO;
        button_config_t cfg_close = cfg_open;
        cfg_close.gpio_button_config.gpio_num = BTN_CLOSE_GPIO;

        btn_open  = button_create(&cfg_open);
        btn_stop  = button_create(&cfg_stop);
        btn_close = button_create(&cfg_close);

        // The exact event names depend on the esp32-button version.
        // These constants are typical for achimpieters/esp32-button:
        button_add_on_press_cb(btn_open,   BUTTON_SINGLE_CLICK,       btn_open_single_cb,  NULL);
        button_add_on_press_cb(btn_close,  BUTTON_SINGLE_CLICK,       btn_close_single_cb, NULL);
        button_add_on_press_cb(btn_stop,   BUTTON_SINGLE_CLICK,       btn_stop_single_cb,  NULL);
        button_add_on_press_cb(btn_stop,   BUTTON_DOUBLE_CLICK,       btn_stop_double_cb,  NULL);
        button_add_on_press_cb(btn_stop,   BUTTON_LONG_PRESS_START,   btn_stop_long_cb,    NULL);
}

// -----------------------------------------------------------------------------
// Accessory & config
// -----------------------------------------------------------------------------
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(.id = 1,
                          .category = homekit_accessory_category_window_coverings,
                          .services = (homekit_service_t*[]) {
                // Accessory Information
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t*[]) {
                        &name, &manufacturer, &serial, &model, &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
                        NULL
                }),
                // Window Covering (primary)
                HOMEKIT_SERVICE(WINDOW_COVERING, .primary = true, .characteristics = (homekit_characteristic_t*[]) {
                        HOMEKIT_CHARACTERISTIC(NAME, "Sunshade"),
                        &current_position,
                        HOMEKIT_CHARACTERISTIC(TARGET_POSITION, 0, .setter = target_position_set),
                        &position_state,
                        &obstruction_detected,
                        HOMEKIT_CHARACTERISTIC(HOLD_POSITION, false, .setter = hold_position_set),
                        &ota_trigger,
                        NULL
                }),
                // Optional: Recalibrate switch (momentary)
                HOMEKIT_SERVICE(SWITCH, .characteristics = (homekit_characteristic_t*[]) {
                        HOMEKIT_CHARACTERISTIC(NAME, "Recalibrate"),
                        &recalibrate_switch,
                        NULL
                }),
                NULL
        }
                          ),
        NULL
};
#pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId  = CONFIG_ESP_SETUP_ID,
};

// -----------------------------------------------------------------------------
// Wi-Fi/HomeKit bootstrap
// -----------------------------------------------------------------------------
static void on_wifi_ready(void) {
        static bool started = false;
        if (started) return;
        ESP_LOGI("INFO", "Starting HomeKit server…");
        homekit_server_init(&config);
        started = true;
        // From now on, use idle color unless moving
        if (calib_state == CAL_IDLE) pix_state = PIX_IDLE;
}

// -----------------------------------------------------------------------------
// App main
// -----------------------------------------------------------------------------
void app_main(void) {
        // NVS init (for calibration storage)
        ESP_ERROR_CHECK(nvs_flash_init());

        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state("INFO");
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFO"));

        // GPIOs
        gpio_init_led();
        gpio_init_motor();

        // NeoPixel
        neopixel_init();
        pix_state = PIX_WIFI_WAIT;

        // Buttons
        buttons_init();

        // Load calibration
        uint32_t nvs_ms = 0;
        if (calib_load(&nvs_ms) == ESP_OK) {
                full_travel_ms = nvs_ms;
                ESP_LOGI("CAL", "Loaded full_travel_ms from NVS: %u ms", full_travel_ms);
        } else {
                ESP_LOGW("CAL", "No calibration found; using fallback %u ms", full_travel_ms);
        }

        // Start Wi-Fi
        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW("WIFI", "WiFi configuration not found; provisioning required");
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE("WIFI", "Failed to start WiFi: %s", esp_err_to_name(wifi_err));
        }
}
